Revit 2027 API
CustomExporter.Export(IList<ElementId>) Method
 Exports a collection of 3D or 2D views
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Export(
	IList<ElementId> viewIds
)
Public Sub Export (
	viewIds As IList(Of ElementId)
)
public:
void Export(
	IList<ElementId^>^ viewIds
)
member Export :
        viewIds : IList<ElementId> -> unit
Parameters
viewIds IList<ElementId>
 An array of views to export
Exceptions
Exception | Condition
ArgumentException |  One or more elements in viewIds is not a valid exportable view. For example, templates are not considered valid views to export.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The instance of IExportContext is not valid. -or- Rendering is currently not supported in the running instance of Revit. One reason for that to happen is that rendering and material libraries are not currently available.
Remarks
Note that the actual export process may differ depending on the type of export context used. For example, when the IModelExportContext is used, Revit is likely to perform several rounds of traversing each view, which may result in invoking the OnViewBegin/OnViewEnd method multiple times for every one view. It is because Revit draws objects in several layers (model layer, annotation layer, etc.) and will traverse each layer individually. In the most common scenario the user will receive two invocations of OnViewBegin/OnViewEnd: In the first round, all model entities will be received, while in the second round all text annotation elements will be received, if any present in the given view.
Note that all views in the collection must be either 3D or 2D views and they must match the exporter context.
Note that currently the only 2D view types exported are IncludeGeometricObjects FloorPlan, CeilingPlan,Elevation, Section, Detail, EngineeringPlan, AreaPlan.
See Also
Reference
CustomExporter Class
Export Overload
Autodesk.Revit.DB Namespace